[
  {
    "name": "Flat Barbell Bench Press",
    "equipment": "barbell",
    "muscleGroup": "Chest",
    "difficulty": "Intermediate",
    "custom": false,
    "instructions": "To perform the flat barbell bench press, start by setting the barbell on a rack at chest height and lying back on a flat bench with your feet flat on the floor and a natural arch in your lower back. Grip the barbell slightly wider than shoulder-width, un-rack it, and position it above your chest with arms extended. Lower the barbell slowly to your chest, then press it back up to the starting position. Breathe in as you lower the bar and exhale as you press up. Aim for 8-12 reps and 3-4 sets. Use a spotter for heavy weights, maintain good form throughout, and remember to warm up before starting and stretch afterward.",
    "tutorialLink": "@/assets/exercises/flat_barbell_bench.gif"
  },
  {
    "name": "Incline Barbell Bench Press",
    "equipment": "barbell",
    "muscleGroup": "Chest",
    "difficulty": "Intermediate",
    "custom": false,
    "instructions": "To perform the incline barbell bench press, set an adjustable bench to a 30-45 degree incline, lie back on the bench, grip the barbell with your hands slightly wider than shoulder-width, lower the barbell to your upper chest, and then press it back up to the starting position.",
    "tutorialLink": "@/assets/exercises/incline_barbell_bench.gif"
  },
  {
    "name": "Decline Barbell Bench Press",
    "equipment": "barbell",
    "muscleGroup": "Chest",
    "difficulty": "Intermediate",
    "custom": false,
    "instructions": "To perform the decline barbell bench press, lie on a decline bench with your feet secured, grip the barbell slightly wider than shoulder-width, lower the barbell to your chest, and then press it back up to the starting position.",
    "tutorialLink": "@/assets/exercises/decline_barbell_bench.gif"
  },
  {
    "name": "Incline Dumbbell Bench Press",
    "equipment": "dumbbell",
    "muscleGroup": "Chest",
    "difficulty": "Intermediate",
    "custom": false,
    "instructions": "To perform an incline dumbbell bench press, lie back on an inclined bench with dumbbells in hand, press the weights up above your chest, and then lower them slowly until your elbows are at a 90-degree angle before pressing them back up.",
    "tutorialLink": "@/assets/exercises/decline_barbell_bench.gif"
  },
  {
    "name": "Flat Dumbbell Bench Press",
    "equipment": "dumbbell",
    "muscleGroup": "Chest",
    "difficulty": "Intermediate",
    "custom": false,
    "instructions": "To perform a flat dumbbell bench press, lie back on a flat bench with a dumbbell in each hand, press the weights up above your chest, and then lower them slowly until your elbows are at a 90-degree angle before pressing them back up.",
    "tutorialLink": "@/assets/exercises/incline_dumbbell_bench.gif"
  },
  {
    "name": "Dumbbell Flyes",
    "equipment": "dumbbell",
    "muscleGroup": "Chest",
    "difficulty": "Intermediate",
    "custom": false,
    "instructions": "To perform dumbbell flyes, lie back on a flat bench with a dumbbell in each hand, extend your arms straight up above your chest, and then slowly lower the weights out to the sides with a slight bend in your elbows until you feel a stretch in your chest, before bringing the dumbbells back together.",
    "tutorialLink": "@/assets/exercises/dumbbell_fly_bench.gif"
  },
  {
    "name": "Deadlift",
    "equipment": "barbell",
    "muscleGroup": "Back",
    "difficulty": "Advanced",
    "custom": false,
    "instructions": "To perform the barbell deadlift, stand with your feet hip-width apart and the barbell over your mid-foot. Bend at the hips and knees to grip the barbell with your hands slightly wider than shoulder-width apart. Keeping your back flat and chest up, drive through your heels to lift the barbell, extending your hips and knees. Once you reach a standing position, lower the barbell back to the ground with control. Breathe in as you lower the bar and exhale as you lift. Aim for 6-10 reps and 3-4 sets. Use proper form to avoid injury and consider using a belt for added support.",
    "tutorialLink": "@/assets/exercises/barbell_deadlift.gif"
  },
  {
    "name": "Bent-Over Barbell Row",
    "equipment": "barbell",
    "muscleGroup": "Back",
    "difficulty": "Intermediate",
    "custom": false,
    "instructions": "To perform the bent-over barbell row, stand with your feet shoulder-width apart and bend at the hips and knees, keeping your back straight and chest up. Grip the barbell with your hands slightly wider than shoulder-width apart. Pull the barbell towards your lower rib cage, squeezing your shoulder blades together at the top of the movement. Lower the barbell back down with control. Breathe in as you lower the bar and exhale as you pull up. Aim for 8-12 reps and 3-4 sets. Ensure proper form to avoid lower back strain.",
    "tutorialLink": "@/assets/exercises/bent_over_barbell_row.gif"
  },
  {
    "name": "Barbell T-Bar Row",
    "equipment": "barbell",
    "muscleGroup": "Back",
    "difficulty": "Intermediate",
    "custom": false,
    "instructions": "To perform the barbell T-bar row, place one end of a barbell in a corner or use a T-bar row machine if available. Stand over the barbell with your feet shoulder-width apart and grip the bar with both hands. Bend at the hips and knees, keeping your back flat. Row the barbell towards your chest, squeezing your shoulder blades together at the top of the movement. Lower the barbell back to the starting position with control. Breathe in as you lower the bar and exhale as you row up. Aim for 8-12 reps and 3-4 sets. Use proper form to avoid injury and engage your back muscles effectively.",
    "tutorialLink": "@/assets/exercises/barbell_t_bar_row.gif"
  },
  {
    "name": "Barbell Shrugs",
    "equipment": "barbell",
    "muscleGroup": "Back",
    "difficulty": "Beginner",
    "custom": false,
    "instructions": "To perform barbell shrugs, stand with your feet shoulder-width apart and hold the barbell with an overhand grip at thigh level. Keeping your arms straight, lift your shoulders towards your ears as high as possible, squeezing your traps at the top. Lower your shoulders back down slowly. Breathe in as you lower and exhale as you shrug up. Aim for 10-15 reps and 3-4 sets. Ensure good posture and avoid using heavy weights that could compromise form.",
    "tutorialLink": "@/assets/exercises/barbell_shrugs.gif"
  },
  {
    "name": "Dumbbell Bent-Over Row",
    "equipment": "dumbbell",
    "muscleGroup": "Back",
    "difficulty": "Intermediate",
    "custom": false,
    "instructions": "To perform the dumbbell bent-over row, hold a dumbbell in each hand with your palms facing your body. Bend at the hips and knees while keeping your back straight. Pull the dumbbells towards your lower rib cage, squeezing your shoulder blades together at the top of the movement. Lower the dumbbells back down with control. Breathe in as you lower the weights and exhale as you pull them up. Aim for 8-12 reps and 3-4 sets. Maintain proper posture throughout to avoid strain on your lower back.",
    "tutorialLink": "@/assets/exercises/dumbbell_bent_over_row.gif"
  },
  {
    "name": "Dumbbell Single-Arm Row",
    "equipment": "dumbbell",
    "muscleGroup": "Back",
    "difficulty": "Intermediate",
    "custom": false,
    "instructions": "To perform the dumbbell single-arm row, place one knee and hand on a bench for support, keeping your back flat. With the other hand, hold a dumbbell with your palm facing inwards. Row the dumbbell towards your hip, squeezing your shoulder blade at the top of the movement. Lower the dumbbell back down with control. Breathe in as you lower the dumbbell and exhale as you row it up. Aim for 8-12 reps per side and 3-4 sets. Ensure a stable position on the bench to maximize effectiveness and prevent injury.",
    "tutorialLink": "@/assets/exercises/dumbbell_single_arm_row.gif"
  },
  {
    "name": "Dumbbell Shrugs",
    "equipment": "dumbbell",
    "muscleGroup": "Back",
    "difficulty": "Beginner",
    "custom": false,
    "instructions": "To perform dumbbell shrugs, stand with your feet shoulder-width apart and hold a dumbbell in each hand at your sides. Keeping your arms straight, lift your shoulders towards your ears as high as possible, squeezing your traps at the top of the movement. Lower your shoulders back down slowly. Breathe in as you lower the weights and exhale as you shrug up. Aim for 10-15 reps and 3-4 sets. Focus on controlled movements to effectively target your traps and avoid excessive weight that could compromise form.",
    "tutorialLink": "@/assets/exercises/dumbbell_shrugs.gif"
  },
  {
    "name": "Shoulder Press",
    "equipment": "dumbbell",
    "muscleGroup": "Shoulders",
    "difficulty": "Intermediate",
    "custom": false,
    "instructions": "To perform the dumbbell shoulder press, sit or stand with a dumbbell in each hand at shoulder height, palms facing forward. Press the dumbbells upward until your arms are fully extended above your head. Lower the dumbbells back to shoulder height with control. Breathe in as you lower the weights and exhale as you press them up. Aim for 8-12 reps and 3-4 sets. Keep your core engaged and avoid arching your back during the movement.",
    "tutorialLink": "@/assets/exercises/dumbbell_shoulder_press.gif"
  },
  {
    "name": "Lateral Raise",
    "equipment": "dumbbell",
    "muscleGroup": "Shoulders",
    "difficulty": "Beginner",
    "custom": false,
    "instructions": "To perform the dumbbell lateral raise, stand with your feet shoulder-width apart and hold a dumbbell in each hand at your sides. Keeping a slight bend in your elbows, lift the dumbbells out to the sides until they reach shoulder height. Lower the dumbbells back down slowly with control. Breathe in as you lower the weights and exhale as you lift them. Aim for 12-15 reps and 3-4 sets. Focus on controlled, deliberate movements to maximize shoulder engagement and avoid using excessive weight.",
    "tutorialLink": "@/assets/exercises/dumbbell_lateral_raise.gif"
  },
  {
    "name": "Front Raise",
    "equipment": "dumbbell",
    "muscleGroup": "Shoulders",
    "difficulty": "Beginner",
    "custom": false,
    "instructions": "To perform the dumbbell front raise, stand with your feet shoulder-width apart and hold a dumbbell in each hand in front of your thighs. Keeping your arms straight, lift the dumbbells in front of you to shoulder height. Lower the dumbbells back down with control. Breathe in as you lower the weights and exhale as you lift them. Aim for 10-12 reps and 3-4 sets. Avoid swinging your body to lift the weights and focus on isolating the front deltoids.",
    "tutorialLink": "@/assets/exercises/dumbbell_front_raise.gif"
  },
  {
    "name": "Rear Delt Fly",
    "equipment": "dumbbell",
    "muscleGroup": "Shoulders",
    "difficulty": "Intermediate",
    "custom": false,
    "instructions": "To perform the dumbbell rear delt fly, bend at the hips with a slight bend in your knees, holding a dumbbell in each hand with your palms facing each other. With a slight bend in your elbows, lift the dumbbells out to the sides until your arms are parallel to the floor. Squeeze your shoulder blades together at the top of the movement. Lower the dumbbells back down with control. Breathe in as you lower the weights and exhale as you lift them. Aim for 10-12 reps and 3-4 sets. Maintain a neutral spine throughout the exercise to prevent lower back strain.",
    "tutorialLink": "@/assets/exercises/dumbbell_rear_delt_fly.gif"
  },
  {
    "name": "Dumbbell Bicep Curl",
    "equipment": "dumbbell",
    "muscleGroup": "Arms",
    "difficulty": "Beginner",
    "custom": false,
    "instructions": "To perform the dumbbell bicep curl, stand with your feet shoulder-width apart and hold a dumbbell in each hand with your palms facing forward. Keeping your elbows close to your torso, curl the dumbbells towards your shoulders while contracting your biceps. Slowly lower the dumbbells back to the starting position. Breathe in as you lower the weights and exhale as you curl them up. Aim for 10-15 reps and 3-4 sets. Avoid swinging your body and focus on controlled movements to maximize bicep engagement.",
    "tutorialLink": "@/assets/exercises/dumbbell_bicep_curl.gif"
  },
  {
    "name": "Dumbbell Hammer Curl",
    "equipment": "dumbbell",
    "muscleGroup": "Arms",
    "difficulty": "Beginner",
    "custom": false,
    "instructions": "To perform the dumbbell hammer curl, stand with your feet shoulder-width apart and hold a dumbbell in each hand with your palms facing each other. Keeping your elbows close to your torso, curl the dumbbells towards your shoulders while keeping your palms facing each other. Slowly lower the dumbbells back to the starting position. Breathe in as you lower the weights and exhale as you curl them up. Aim for 10-15 reps and 3-4 sets. Maintain a stable posture to effectively target the brachialis and brachioradialis muscles.",
    "tutorialLink": "@/assets/exercises/dumbbell_hammer_curl.gif"
  },
  {
    "name": "Tricep Dips",
    "equipment": "bodyweight",
    "muscleGroup": "Arms",
    "difficulty": "Intermediate",
    "custom": false,
    "instructions": "To perform tricep dips, position yourself on parallel bars with your arms fully extended and your body upright. Lower your body by bending your elbows until your upper arms are parallel to the floor. Press back up to the starting position by straightening your arms. Breathe in as you lower your body and exhale as you press up. Aim for 8-12 reps and 3-4 sets. Ensure proper form to avoid shoulder strain and engage your triceps effectively.",
    "tutorialLink": "@/assets/exercises/tricep_dips.gif"
  },
  {
    "name": "Overhead Tricep Extension",
    "equipment": "dumbbell",
    "muscleGroup": "Arms",
    "difficulty": "Intermediate",
    "custom": false,
    "instructions": "To perform the overhead tricep extension, stand with your feet shoulder-width apart and hold a dumbbell with both hands above your head, arms fully extended. Lower the dumbbell behind your head by bending your elbows, then press it back up to the starting position. Breathe in as you lower the weight and exhale as you press it up. Aim for 10-12 reps and 3-4 sets. Keep your elbows close to your head and avoid arching your back during the movement.",
    "tutorialLink": "@/assets/exercises/overhead_tricep_extension.gif"
  },
  {
    "name": "Tricep Kickback",
    "equipment": "dumbbell",
    "muscleGroup": "Arms",
    "difficulty": "Intermediate",
    "custom": false,
    "instructions": "To perform the tricep kickback, hold a dumbbell in each hand and bend at the hips with a slight bend in your knees, keeping your back straight. Lift your upper arms so they are parallel to the floor and your elbows are at a 90-degree angle. Extend your arms back, straightening your elbows, then return to the starting position. Breathe in as you bend your elbows and exhale as you extend them. Aim for 10-12 reps and 3-4 sets. Focus on controlled movements to effectively target the triceps.",
    "tutorialLink": "@/assets/exercises/tricep_kickback.gif"
  },
  {
    "name": "Barbell Squat",
    "equipment": "barbell",
    "muscleGroup": "Legs",
    "difficulty": "Intermediate",
    "custom": false,
    "instructions": "To perform the barbell squat, stand with your feet shoulder-width apart and the barbell resting on your upper back. Bend at the hips and knees to lower your body until your thighs are parallel to the floor, then press back up to the starting position. Breathe in as you lower your body and exhale as you press up. Aim for 8-12 reps and 3-4 sets. Maintain proper form to avoid injury and engage your core throughout the movement.",
    "tutorialLink": "@/assets/exercises/barbell_squat.gif"
  },
  {
    "name": "Leg Press",
    "equipment": "machine",
    "muscleGroup": "Legs",
    "difficulty": "Beginner",
    "custom": false,
    "instructions": "To perform the leg press, sit on the leg press machine with your feet shoulder-width apart on the platform. Lower the platform by bending your knees until your thighs are parallel to the floor, then press back up to the starting position. Breathe in as you lower the platform and exhale as you press up. Aim for 10-15 reps and 3-4 sets. Ensure proper foot placement and avoid locking your knees at the top of the movement.",
    "tutorialLink": "@/assets/exercises/leg_press.gif"
  },
  {
    "name": "Lunges",
    "equipment": "bodyweight",
    "muscleGroup": "Legs",
    "difficulty": "Beginner",
    "custom": false,
    "instructions": "To perform lunges, stand with your feet together and take a step forward with one leg. Lower your body until both knees are bent at a 90-degree angle, then press back up to the starting position. Alternate legs with each rep. Breathe in as you lower your body and exhale as you press up. Aim for 10-12 reps per leg and 3-4 sets. Maintain proper form to avoid knee strain and engage your core throughout the movement.",
    "tutorialLink": "@/assets/exercises/lunges.gif"
  },
  {
    "name": "Leg Curl",
    "equipment": "machine",
    "muscleGroup": "Legs",
    "difficulty": "Beginner",
    "custom": false,
    "instructions": "To perform the leg curl, lie face down on the leg curl machine with your ankles under the padded lever. Curl your legs up towards your glutes, then lower them back to the starting position. Breathe in as you lower your legs and exhale as you curl them up. Aim for 10-15 reps and 3-4 sets. Focus on controlled movements to effectively target the hamstrings.",
    "tutorialLink": "@/assets/exercises/leg_curl.gif"
  },
  {
    "name": "Leg Extension",
    "equipment": "machine",
    "muscleGroup": "Legs",
    "difficulty": "Beginner",
    "custom": false,
    "instructions": "To perform the leg extension, sit on the leg extension machine with your ankles under the padded lever. Extend your legs until they are straight, then lower them back to the starting position. Breathe in as you lower your legs and exhale as you extend them. Aim for 10-15 reps and 3-4 sets. Ensure proper form to avoid knee strain and focus on controlled movements.",
    "tutorialLink": "@/assets/exercises/leg_extension.gif"
  },
  {
    "name": "Calf Raise",
    "equipment": "bodyweight",
    "muscleGroup": "Legs",
    "difficulty": "Beginner",
    "custom": false,
    "instructions": "To perform calf raises, stand with your feet shoulder-width apart and your toes on the edge of a step or platform. Raise your heels as high as possible, then lower them back down with control. Breathe in as you lower your heels and exhale as you raise them. Aim for 15-20 reps and 3-4 sets. Focus on controlled movements to effectively target the calf muscles.",
    "tutorialLink": "@/assets/exercises/calf_raise.gif"
  }
]